dougg3/mac-rom-simm-programmer/hal/m258ke/nuvoton/tk_reg.h
     * |        |          |High level for TK5 threshold control.
     * @var TK_T::THC67
     * Offset: 0x50  Touch Key TK6/TK7 Threshold Control Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[15:8]  |HTH6      |High Threshold of TK6
     * |        |          |High level for TK6 threshold control.
     * |[31:24] |HTH7      |High Threshold of TK7
     * |        |          |High level for TK7 threshold control.
     * @var TK_T::THC89
     * Offset: 0x54  Touch Key TK8/TK9 Threshold Control Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[15:8]  |HTH8      |High Threshold of TK8
     * |        |          |High level for TK8 threshold control.
     * |[31:24] |HTH9      |High Threshold of TK9
     * |        |          |High level for TK9 threshold control.
     * @var TK_T::THC1011
     * Offset: 0x58  Touch Key TK10/TK11 Threshold Control Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[15:8]  |HTH10     |High Threshold of TK10
     * |        |          |High level for TK10 threshold control.
     * |[31:24] |HTH11     |High Threshold of TK11
     * |        |          |High level for TK11 threshold control.
     * @var TK_T::THC1213
     * Offset: 0x5C  Touch Key TK12/TK13 Threshold Control Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[15:8]  |HTH12     |High Threshold of TK12
     * |        |          |High level for TK12 threshold control.
     * |[31:24] |HTH13     |High Threshold of TK13
     * |        |          |High level for TK13 threshold control.
     * @var TK_T::THC1415
     * Offset: 0x60  Touch Key TK14/TK15 Threshold Control Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[15:8]  |HTH14     |High Threshold of TK14
     * |        |          |High level for TK14 threshold control.
     * |[31:24] |HTH15     |High Threshold of TK15
     * |        |          |High level for TK15 threshold control.
     * @var TK_T::THC16
     * Offset: 0x64  Touch Key TK16 Threshold Control Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[15:8]  |HTH16     |High Threshold of TK16
     * |        |          |High level for TK16 threshold control.
     * |[31:24] |HTH_ALL   |High Threshold of All Keys Scan
     * |        |          |High level for All Keys Scan threshold control.
     * @var TK_T::TK_REFCBD0
     * Offset: 0x68  Touch Key Reference Capacitor Bank Data Register 0
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[7:0]   |CBD0      |TK0 Capacitor Bank Data
     * |        |          |This is register is used for TK0 sensitivity adjustment.
     * |[15:8]  |CBD1      |TK1 Capacitor Bank Data
     * |        |          |This is register is used for TK1 sensitivity adjustment.
     * |[23:16] |CBD2      |TK2 Capacitor Bank Data
     * |        |          |This is register is used for TK2 sensitivity adjustment.
     * |[31:24] |CBD3      |TK3 Capacitor Bank Data
     * |        |          |This is register is used for TK3 sensitivity adjustment.
     * @var TK_T::TK_REFCBD1
     * Offset: 0x6C  Touch Key Reference Capacitor Bank Data Register 1
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[7:0]   |CBD4      |TK4 Capacitor Bank Data
     * |        |          |This is register is used for TK4 sensitivity adjustment.
     * |[15:8]  |CBD5      |TK5 Capacitor Bank Data
     * |        |          |This is register is used for TK5 sensitivity adjustment.
     * |[23:16] |CBD6      |TK6 Capacitor Bank Data
     * |        |          |This is register is used for TK6 sensitivity adjustment.
     * |[31:24] |CBD7      |TK7 Capacitor Bank Data
     * |        |          |This is register is used for TK7 sensitivity adjustment.
     * @var TK_T::TK_REFCBD2
     * Offset: 0x70  Touch Key Reference Capacitor Bank Data Register 2
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[7:0]   |CBD8      |TK8 Capacitor Bank Data
     * |        |          |This is register is used for TK8 sensitivity adjustment.
     * |[15:8]  |CBD9      |TK9 Capacitor Bank Data
     * |        |          |This is register is used for TK9 sensitivity adjustment.
     * |[23:16] |CBD10     |TK10 Capacitor Bank Data
     * |        |          |This is register is used for TK10 sensitivity adjustment.
     * |[31:24] |CBD11     |TK11 Capacitor Bank Data
     * |        |          |This is register is used for TK11 sensitivity adjustment.
     * @var TK_T::TK_REFCBD3
     * Offset: 0x74  Touch Key Reference Capacitor Bank Data Register 3
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[7:0]   |CBD12     |TK12 Capacitor Bank Data
     * |        |          |This is register is used for TK12 sensitivity adjustment.
     * |[15:8]  |CBD13     |TK13 Capacitor Bank Data
     * |        |          |This is register is used for TK13 sensitivity adjustment.
     * |[23:16] |CBD14     |TK14 Capacitor Bank Data
     * |        |          |This is register is used for TK14 sensitivity adjustment.
     * |[31:24] |CBD15     |TK15 Capacitor Bank Data
     * |        |          |This is register is used for TK15 sensitivity adjustment.
     * @var TK_T::TK_REFCBD4
     * Offset: 0x78  Touch Key Reference Capacitor Bank Data Register 4
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[7:0]   |CBD16     |TK16 Capacitor Bank Data
     * |        |          |This is register is used for TK16 sensitivity adjustment.
     * |[15:8]  |CBD_ALL   |All Keys Scan Capacitor Bank Data
     * |        |          |This is register is used for All Keys Scan sensitivity adjustment.

     */
    __IO uint32_t SCANC;                 /*!< [0x0000] Touch Key Scan Control Register                                  */
    __IO uint32_t REFC;                  /*!< [0x0004] Touch Key Reference Control Register                             */
    __IO uint32_t CCBD0;                 /*!< [0x0008] Touch Key Complement Capacitor Bank Data Register 0              */
    __IO uint32_t CCBD1;                 /*!< [0x000c] Touch Key Complement Capacitor Bank Data Register 1              */
    __IO uint32_t CCBD2;                 /*!< [0x0010] Touch Key Complement Capacitor Bank Data Register 2              */
    __IO uint32_t CCBD3;                 /*!< [0x0014] Touch Key Complement Capacitor Bank Data Register 3              */
    __IO uint32_t CCBD4;                 /*!< [0x0018] Touch Key Complement Capacitor Bank Data Register 4              */
    __IO uint32_t IDLSC;                 /*!< [0x001c] Touch Key Idle State Control Register                            */
    __IO uint32_t POLSEL;                /*!< [0x0020] Touch Key Polarity Select Register                               */
    __IO uint32_t POLC;                  /*!< [0x0024] Touch Key Polarity Control Register                              */
    __IO uint32_t STA;                   /*!< [0x0028] Touch Key Status Register                                        */
    __I  uint32_t DAT0;                  /*!< [0x002c] Touch Key Data Register 0                                        */
    __I  uint32_t DAT1;                  /*!< [0x0030] Touch Key Data Register 1                                        */
    __I  uint32_t DAT2;                  /*!< [0x0034] Touch Key Data Register 2                                        */
    __I  uint32_t DAT3;                  /*!< [0x0038] Touch Key Data Register 3                                        */
    __I  uint32_t DAT4;                  /*!< [0x003c] Touch Key Data Register 4                                        */
    __IO uint32_t INTEN;                 /*!< [0x0040] Touch Key Interrupt Enable Register                              */
    __IO uint32_t THC01;                 /*!< [0x0044] Touch Key TK0/TK1 Threshold Control Register                     */
    __IO uint32_t THC23;                 /*!< [0x0048] Touch Key TK2/TK3 Threshold Control Register                     */
    __IO uint32_t THC45;                 /*!< [0x004c] Touch Key TK4/TK5 Threshold Control Register                     */
    __IO uint32_t THC67;                 /*!< [0x0050] Touch Key TK6/TK7 Threshold Control Register                     */
    __IO uint32_t THC89;                 /*!< [0x0054] Touch Key TK8/TK9 Threshold Control Register                     */
    __IO uint32_t THC1011;               /*!< [0x0058] Touch Key TK10/TK11 Threshold Control Register                   */
    __IO uint32_t THC1213;               /*!< [0x005c] Touch Key TK12/TK13 Threshold Control Register                   */
    __IO uint32_t THC1415;               /*!< [0x0060] Touch Key TK14/TK15 Threshold Control Register                   */
    __IO uint32_t THC16;                 /*!< [0x0064] Touch Key TK16 Threshold Control Register                        */
    __IO uint32_t TK_REFCBD0;            /*!< [0x0068] Touch Key Reference Capacitor Bank Data Register 0               */
    __IO uint32_t TK_REFCBD1;            /*!< [0x006C] Touch Key Reference Capacitor Bank Data Register 1               */
    __IO uint32_t TK_REFCBD2;            /*!< [0x0070] Touch Key Reference Capacitor Bank Data Register 2               */
    __IO uint32_t TK_REFCBD3;            /*!< [0x0074] Touch Key Reference Capacitor Bank Data Register 3               */
    __IO uint32_t TK_REFCBD4;            /*!< [0x0078] Touch Key Reference Capacitor Bank Data Register 4               */
    __I  uint32_t RESERVED;              /*!< [0x007c] Reserved                                                         */
    __IO uint32_t SCANC1;                /*!< [0x0080] Touch Key Scan Control Register 1                                */
    __IO uint32_t REFC1;                 /*!< [0x0084] Touch Key Reference Control Register 1                           */
    __IO uint32_t CCBD5;                 /*!< [0x0088] Touch Key Complement Capacitor Bank Data Register 5              */
    __IO uint32_t CCBD6;                 /*!< [0x008c] Touch Key Complement Capacitor Bank Data Register 6              */
    __IO uint32_t CCBD7;                 /*!< [0x0090] Touch Key Complement Capacitor Bank Data Register 7              */
    __I  uint32_t RESERVED1[2];          /*!< [0x0094]~[0x0098] Reserved                                                */
    __IO uint32_t IDLSC1;                /*!< [0x009c] Touch Key Idle State Control Register 1                          */
    __IO uint32_t POLSEL1;               /*!< [0x00A0] Touch Key Polarity Select Register 1                             */
    __IO uint32_t POLC1;                 /*!< [0x00A4] Touch Key Polarity Control Register 1                            */
    __IO  uint32_t STA1;                 /*!< [0x00A8] Touch Key Status Register 1                                      */
    __I  uint32_t DAT5;                  /*!< [0x00Ac] Touch Key Data Register 5                                        */
    __I  uint32_t DAT6;                  /*!< [0x00B0] Touch Key Data Register 6                                        */
    __I  uint32_t DAT7;                  /*!< [0x00B4] Touch Key Data Register 7                                        */
    __I  uint32_t RESERVE2[3];           /*!< [0x00B8]~[0x00C0] Reserved                                                */
    __IO uint32_t THC1718;               /*!< [0x00C4] Touch Key TK17/TK18 Threshold Control Register                   */
    __IO uint32_t THC1920;               /*!< [0x00C8] Touch Key TK19/TK20 Threshold Control Register                   */
    __IO uint32_t THC2122;               /*!< [0x00Cc] Touch Key TK21/TK22 Threshold Control Register                   */
    __IO uint32_t THC2324;               /*!< [0x00D0] Touch Key TK23/TK24 Threshold Control Register                   */
    __IO uint32_t THC25;                 /*!< [0x00D4] Touch Key TK25 Threshold Control Register                        */
    __I  uint32_t RESERVE3[4];           /*!< [0x00D8]~[0x00E4] Reserved                                                */
    __IO uint32_t TK_REFCBD5;            /*!< [0x00E8] Touch Key Reference Capacitor Bank Data Register 5               */
    __IO uint32_t TK_REFCBD6;            /*!< [0x00EC] Touch Key Reference Capacitor Bank Data Register 6               */
    __IO uint32_t TK_REFCBD7;            /*!< [0x00F0] Touch Key Reference Capacitor Bank Data Register 7               */

} TK_T;

/**
    @addtogroup TK_CONST TK Bit Field Definition
    Constant Definitions for TK Controller
@{ */

