dougg3/mac-rom-simm-programmer/hal/m258ke/nuvoton/tk_reg.h
#define TK_CCBD4_CCBD_ALL_Pos            (8)                                               /*!< TK_T::CCBD4: CCBD_ALL Position         */
#define TK_CCBD4_CCBD_ALL_Msk            (0xfful << TK_CCBD4_CCBD_ALL_Pos)                 /*!< TK_T::CCBD4: CCBD_ALL Mask             */

#define TK_CCBD5_CCBD17_Pos              (0)                                               /*!< TK_T::CCBD5: CCBD17 Position           */
#define TK_CCBD5_CCBD17_Msk              (0xfful << TK_CCBD5_CCBD17_Pos)                   /*!< TK_T::CCBD5: CCBD17 Mask               */

#define TK_CCBD5_CCBD18_Pos              (8)                                               /*!< TK_T::CCBD5: CCBD18 Position           */
#define TK_CCBD5_CCBD18_Msk              (0xfful << TK_CCBD5_CCBD18_Pos)                   /*!< TK_T::CCBD5: CCBD18 Mask               */

#define TK_CCBD5_CCBD19_Pos              (16)                                              /*!< TK_T::CCBD5: CCBD19 Position           */
#define TK_CCBD5_CCBD19_Msk              (0xfful << TK_CCBD5_CCBD19_Pos)                   /*!< TK_T::CCBD5: CCBD19 Mask               */

#define TK_CCBD5_CCBD20_Pos              (24)                                              /*!< TK_T::CCBD5: CCBD20 Position           */
#define TK_CCBD5_CCBD20_Msk              (0xfful << TK_CCBD5_CCBD20_Pos)                   /*!< TK_T::CCBD5: CCBD20 Mask               */

#define TK_CCBD6_CCBD21_Pos              (0)                                               /*!< TK_T::CCBD6: CCBD21 Position           */
#define TK_CCBD6_CCBD21_Msk              (0xfful << TK_CCBD6_CCBD21_Pos)                   /*!< TK_T::CCBD6: CCBD21 Mask               */

#define TK_CCBD6_CCBD22_Pos              (8)                                               /*!< TK_T::CCBD6: CCBD22 Position           */
#define TK_CCBD6_CCBD22_Msk              (0xfful << TK_CCBD6_CCBD22_Pos)                   /*!< TK_T::CCBD6: CCBD22 Mask               */

#define TK_CCBD6_CCBD23_Pos              (16)                                              /*!< TK_T::CCBD6: CCBD23 Position           */
#define TK_CCBD6_CCBD23_Msk              (0xfful << TK_CCBD6_CCBD23_Pos)                   /*!< TK_T::CCBD6: CCBD23 Mask               */

#define TK_CCBD6_CCBD24_Pos              (24)                                              /*!< TK_T::CCBD6: CCBD24 Position           */
#define TK_CCBD6_CCBD24_Msk              (0xfful << TK_CCBD6_CCBD24_Pos)                   /*!< TK_T::CCBD6: CCBD24 Mask               */

#define TK_CCBD7_CCBD25_Pos              (0)                                               /*!< TK_T::CCBD7: CCBD25 Position           */
#define TK_CCBD7_CCBD25_Msk              (0xfful << TK_CCBD7_CCBD25_Pos)                   /*!< TK_T::CCBD7: CCBD25 Mask               */

#define TK_IDLSC_IDLS0_Pos               (0)                                               /*!< TK_T::IDLSC: IDLS0 Position            */
#define TK_IDLSC_IDLS0_Msk               (0x3ul << TK_IDLSC_IDLS0_Pos)                     /*!< TK_T::IDLSC: IDLS0 Mask                */

#define TK_IDLSC_IDLS1_Pos               (2)                                               /*!< TK_T::IDLSC: IDLS1 Position            */
#define TK_IDLSC_IDLS1_Msk               (0x3ul << TK_IDLSC_IDLS1_Pos)                     /*!< TK_T::IDLSC: IDLS1 Mask                */

#define TK_IDLSC_IDLS2_Pos               (4)                                               /*!< TK_T::IDLSC: IDLS2 Position            */
#define TK_IDLSC_IDLS2_Msk               (0x3ul << TK_IDLSC_IDLS2_Pos)                     /*!< TK_T::IDLSC: IDLS2 Mask                */

#define TK_IDLSC_IDLS3_Pos               (6)                                               /*!< TK_T::IDLSC: IDLS3 Position            */
#define TK_IDLSC_IDLS3_Msk               (0x3ul << TK_IDLSC_IDLS3_Pos)                     /*!< TK_T::IDLSC: IDLS3 Mask                */

#define TK_IDLSC_IDLS4_Pos               (8)                                               /*!< TK_T::IDLSC: IDLS4 Position            */
#define TK_IDLSC_IDLS4_Msk               (0x3ul << TK_IDLSC_IDLS4_Pos)                     /*!< TK_T::IDLSC: IDLS4 Mask                */

#define TK_IDLSC_IDLS5_Pos               (10)                                              /*!< TK_T::IDLSC: IDLS5 Position            */
#define TK_IDLSC_IDLS5_Msk               (0x3ul << TK_IDLSC_IDLS5_Pos)                     /*!< TK_T::IDLSC: IDLS5 Mask                */

#define TK_IDLSC_IDLS6_Pos               (12)                                              /*!< TK_T::IDLSC: IDLS6 Position            */
#define TK_IDLSC_IDLS6_Msk               (0x3ul << TK_IDLSC_IDLS6_Pos)                     /*!< TK_T::IDLSC: IDLS6 Mask                */

#define TK_IDLSC_IDLS7_Pos               (14)                                              /*!< TK_T::IDLSC: IDLS7 Position            */
#define TK_IDLSC_IDLS7_Msk               (0x3ul << TK_IDLSC_IDLS7_Pos)                     /*!< TK_T::IDLSC: IDLS7 Mask                */

#define TK_IDLSC_IDLS8_Pos               (16)                                              /*!< TK_T::IDLSC: IDLS8 Position            */
#define TK_IDLSC_IDLS8_Msk               (0x3ul << TK_IDLSC_IDLS8_Pos)                     /*!< TK_T::IDLSC: IDLS8 Mask                */

#define TK_IDLSC_IDLS9_Pos               (18)                                              /*!< TK_T::IDLSC: IDLS9 Position            */
#define TK_IDLSC_IDLS9_Msk               (0x3ul << TK_IDLSC_IDLS9_Pos)                     /*!< TK_T::IDLSC: IDLS9 Mask                */

#define TK_IDLSC_IDLS10_Pos              (20)                                              /*!< TK_T::IDLSC: IDLS10 Position           */
#define TK_IDLSC_IDLS10_Msk              (0x3ul << TK_IDLSC_IDLS10_Pos)                    /*!< TK_T::IDLSC: IDLS10 Mask               */

#define TK_IDLSC_IDLS11_Pos              (22)                                              /*!< TK_T::IDLSC: IDLS11 Position           */
#define TK_IDLSC_IDLS11_Msk              (0x3ul << TK_IDLSC_IDLS11_Pos)                    /*!< TK_T::IDLSC: IDLS11 Mask               */

#define TK_IDLSC_IDLS12_Pos              (24)                                              /*!< TK_T::IDLSC: IDLS12 Position           */
#define TK_IDLSC_IDLS12_Msk              (0x3ul << TK_IDLSC_IDLS12_Pos)                    /*!< TK_T::IDLSC: IDLS12 Mask               */

#define TK_IDLSC_IDLS13_Pos              (26)                                              /*!< TK_T::IDLSC: IDLS13 Position           */
#define TK_IDLSC_IDLS13_Msk              (0x3ul << TK_IDLSC_IDLS13_Pos)                    /*!< TK_T::IDLSC: IDLS13 Mask               */

#define TK_IDLSC_IDLS14_Pos              (28)                                              /*!< TK_T::IDLSC: IDLS14 Position           */
#define TK_IDLSC_IDLS14_Msk              (0x3ul << TK_IDLSC_IDLS14_Pos)                    /*!< TK_T::IDLSC: IDLS14 Mask               */

#define TK_IDLSC_IDLS15_Pos              (30)                                              /*!< TK_T::IDLSC: IDLS15 Position           */
#define TK_IDLSC_IDLS15_Msk              (0x3ul << TK_IDLSC_IDLS15_Pos)                    /*!< TK_T::IDLSC: IDLS15 Mask               */

#define TK_POLC_IDLS16_Pos               (0)                                               /*!< TK_T::POLC: IDLS16 Position            */
#define TK_POLC_IDLS16_Msk               (0x3ul << TK_POLC_IDLS16_Pos)                     /*!< TK_T::POLC: IDLS16 Mask                */

#define TK_IDLSC1_IDLS17_Pos             (0)                                               /*!< TK_T::IDLSC1: IDLS17 Position          */
#define TK_IDLSC1_IDLS17_Msk             (0x3ul << TK_IDLSC1_IDLS17_Pos)                   /*!< TK_T::IDLSC1: IDLS17 Mask              */

#define TK_IDLSC1_IDLS18_Pos             (2)                                               /*!< TK_T::IDLSC1: IDLS18 Position          */
#define TK_IDLSC1_IDLS18_Msk             (0x3ul << TK_IDLSC1_IDLS18_Pos)                   /*!< TK_T::IDLSC1: IDLS18 Mask              */

